zodiaccalculatorservice_metro_metroclients/config/ZodiacCalculatorService.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.1-hudson-28-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.1-hudson-28-. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://server.metro.webservice.ddlab.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://server.metro.webservice.ddlab.com/" name="ZodiacCalculatorImplService">
<types>
<xsd:schema>
<xsd:import namespace="http://server.metro.webservice.ddlab.com/" schemaLocation="http://localhost:8080/zodiaccalculatorservice_metro_manyclients/ZodiacCalculatorService?xsd=1" />
</xsd:schema>
</types>
<message name="getZodiacSign">
<part name="parameters" element="tns:getZodiacSign" />
</message>
<message name="getZodiacSignResponse">
<part name="parameters" element="tns:getZodiacSignResponse" />
</message>
<message name="InvalidZodiacSignException">
<part name="fault" element="tns:InvalidZodiacSignException" />
</message>
<portType name="ZodiacCalculatorImpl">
<operation name="getZodiacSign">
<input wsam:Action="http://server.metro.webservice.ddlab.com/ZodiacCalculatorImpl/getZodiacSignRequest" message="tns:getZodiacSign" />
<output wsam:Action="http://server.metro.webservice.ddlab.com/ZodiacCalculatorImpl/getZodiacSignResponse" message="tns:getZodiacSignResponse" />
<fault message="tns:InvalidZodiacSignException" name="InvalidZodiacSignException" wsam:Action="http://server.metro.webservice.ddlab.com/ZodiacCalculatorImpl/getZodiacSign/Fault/InvalidZodiacSignException" />
</operation>
</portType>
<binding name="ZodiacCalculatorImplPortBinding" type="tns:ZodiacCalculatorImpl">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
<operation name="getZodiacSign">
<soap:operation soapAction="" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
<fault name="InvalidZodiacSignException">
<soap:fault name="InvalidZodiacSignException" use="literal" />
</fault>
</operation>
</binding>
<service name="ZodiacCalculatorImplService">
<port name="ZodiacCalculatorImplPort" binding="tns:ZodiacCalculatorImplPortBinding">
<soap:address location="http://localhost:8080/zodiaccalculatorservice_metro_manyclients/ZodiacCalculatorService" />
</port>
</service>
</definitions>